<img src="http://drive.google.com/uc?export=view&id=1tpOCamr9aWz817atPnyXus8w5gJ3mIts" width=500px>

Proprietary content. Â© Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited.

---
# Hands-on - Advanced Certificate in Software Engineering - IIT Madras
---

# Instructions

- You need to add the code where ever you see "`#### Add your code here ####`"
- Marks are mentioned along with the cells
- **Do not edit any of the prefilled text/code part**

## Run below cells before starting the test - Mandatory

In [1]:
#### Please run this cell. Don't edit anything ####

!pip install --upgrade pip
!pip install ipython-sql

%load_ext sql
%sql sqlite://

Collecting pip
  Downloading pip-21.1.2-py3-none-any.whl (1.5 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 20.1.1
    Uninstalling pip-20.1.1:
      Successfully uninstalled pip-20.1.1

ERROR: Could not install packages due to an EnvironmentError: [WinError 5] Access is denied: 'C:\\Users\\dheep.balaraman\\AppData\\Local\\Temp\\pip-uninstall-10wjlwpk\\pip.exe'
Consider using the `--user` option or check the permissions.

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Requirement already satisfied: ipython>=1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (7.16.1)
Collecting sqlparse
  Downloading sqlparse-0.4.1-py3-none-any.whl (42 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: six in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: setuptools>=18.5 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: pygments in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: decorator in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: backcall in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: pickleshare in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13704 sha256=723f11f9550ce289056aeceb9bfb9bf622179d9610c2709aaaecd6f784e90023
  Stored in directory: c:\users\dheep.balaraman\appdata\local\pip\cache\wheels\48\6d\77\9517cb933af254f51a446f1a5ec9c2be3e45f17384940bce68
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1

## <font color='blue'> Please run the following cell. Don't edit anything </font>

In [2]:
%%sql


CREATE TABLE if not exists `user`(
  `user_id` VARCHAR(50) NOT NULL,
  `user_name` VARCHAR(50) NOT NULL,
  `email` VARCHAR(50) NOT NULL UNIQUE,
  `access_level` VARCHAR(50)
);
 
INSERT INTO `user` (`user_id`,`user_name`,`email`,`access_level`) VALUES ('U101','Alex','alex@office.com','Normal');
INSERT INTO `user` (`user_id`,`user_name`,`email`,`access_level`) VALUES ('U102','Dwight','dwight@office.com','Admin');
INSERT INTO `user` (`user_id`,`user_name`,`email`,`access_level`) VALUES ('U103','Michael','micael@office.com','Admin');
INSERT INTO `user` (`user_id`,`user_name`,`email`,`access_level`) VALUES ('U104','Jim','jim@office.com','Admin');
INSERT INTO `user` (`user_id`,`user_name`,`email`,`access_level`) VALUES ('U105','Pam','pam@office.com','Normal');



CREATE TABLE if not exists `products`(
  `product_id` VARCHAR(50) NOT NULL,
  `product_name` VARCHAR(50) NOT NULL,
  `brand_name` VARCHAR(50) NOT NULL,
  `price` INT
);
 
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('1','soap','vivel',10);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('2','box','naman',15);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('3','shampoo','vivel',30);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('4','detergent','quarts',20);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('5','brush','pepsod',100);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('6','fridge','kelvinator',35);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('7','cooler','kelvinator',40);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('8','shirt','raymond',60);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('9','heater','kelvinator',70);
INSERT INTO `products` (`product_id`,`product_name`,`brand_name`,`price`) VALUES ('10','trouser','raymond',21);

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## <font color='blue'> Please run the following cell. Don't edit anything </font>

In [3]:
%%sql

select * from user;

 * sqlite://
Done.

[('U101', 'Alex', 'alex@office.com', 'Normal'),
 ('U102', 'Dwight', 'dwight@office.com', 'Admin'),
 ('U103', 'Michael', 'micael@office.com', 'Admin'),
 ('U104', 'Jim', 'jim@office.com', 'Admin'),
 ('U105', 'Pam', 'pam@office.com', 'Normal')]

## <font color='blue'> Please run the following cell. Don't edit anything </font>

In [4]:
%%sql

select * from products;

 * sqlite://
Done.

[('1', 'soap', 'vivel', 10),
 ('2', 'box', 'naman', 15),
 ('3', 'shampoo', 'vivel', 30),
 ('4', 'detergent', 'quarts', 20),
 ('5', 'brush', 'pepsod', 100),
 ('6', 'fridge', 'kelvinator', 35),
 ('7', 'cooler', 'kelvinator', 40),
 ('8', 'shirt', 'raymond', 60),
 ('9', 'heater', 'kelvinator', 70),
 ('10', 'trouser', 'raymond', 21)]

## Question 1 (4 Marks)

Count the number of `user_id` with `Normal` access_level in the `user` table.

In [11]:
%%sql

select count(user_id) from user where access_level = 'Normal';

 * sqlite://
Done.

[(2,)]

## Question 2 (3 Marks)

Print the all the product information for `brand_name` `vivel` in the  `products` table.

In [12]:
%%sql

select * from products where brand_name = 'vivel';

 * sqlite://
Done.

[('1', 'soap', 'vivel', 10), ('3', 'shampoo', 'vivel', 30)]

## Question 3 (3 Marks)

Print the all the unique `brand_name` from the `products` table.

In [14]:
%%sql

select distinct(brand_name) from products;

 * sqlite://
Done.

[('vivel',),
 ('naman',),
 ('quarts',),
 ('pepsod',),
 ('kelvinator',),
 ('raymond',)]

In [22]:
%%sql
select count(brand_name), brand_name from products group by brand_name;

 * sqlite://
Done.

[(3, 'kelvinator'),
 (1, 'naman'),
 (1, 'pepsod'),
 (1, 'quarts'),
 (2, 'raymond'),
 (2, 'vivel')]